In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

sns.set()

pd.options.display.max_rows = 10

In [9]:
mnames = ['movie_id', 'titles', 'genres']
# Specify the encoding as 'latin1' which is commonly used for this kind of dataset
movies = pd.read_table('movies.dat', sep='::', header=None, names=mnames, encoding='latin1')
movies.head()

C:\Users\PC-020\AppData\Local\Temp\ipykernel_11048\4271223084.py:3: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  movies = pd.read_table('movies.dat', sep='::', header=None, names=mnames, encoding='latin1')

   movie_id                              titles                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy

In [4]:
rnames= ['user_id', 'movie_id', 'rating', 'timestamp']
ratings= pd.read_table('ratings.dat', sep= '::', header= None, names=rnames)
ratings.head()

C:\Users\PC-020\AppData\Local\Temp\ipykernel_11048\2070278510.py:2: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  ratings= pd.read_table('ratings.dat', sep= '::', header= None, names=rnames)

   user_id  movie_id  rating  timestamp
0        1      1193       5  978300760
1        1       661       3  978302109
2        1       914       3  978301968
3        1      3408       4  978300275
4        1      2355       5  978824291

In [6]:
unames= ['user_id', 'gender', 'age', 'occupation', 'zip']
users= pd.read_table('users.dat', sep= '::', header= None, names=unames)
users.head()

C:\Users\PC-020\AppData\Local\Temp\ipykernel_11048\785809301.py:2: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  users= pd.read_table('users.dat', sep= '::', header= None, names=unames)

   user_id gender  age  occupation    zip
0        1      F    1          10  48067
1        2      M   56          16  70072
2        3      M   25          15  55117
3        4      M   45           7  02460
4        5      M   25          20  55455

In [12]:
rnames= ['user_id', 'movie_id', 'rating', 'timestamp']
ratings2= pd.read_table('C:/Users/PC-020/Documents/movielens/ratings.csv', sep= '::', header= None, names=rnames)

C:\Users\PC-020\AppData\Local\Temp\ipykernel_11048\1232961273.py:2: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  ratings2= pd.read_table('C:/Users/PC-020/Documents/movielens/ratings.csv', sep= '::', header= None, names=rnames)

In [13]:
users[:5]

   user_id gender  age  occupation    zip
0        1      F    1          10  48067
1        2      M   56          16  70072
2        3      M   25          15  55117
3        4      M   45           7  02460
4        5      M   25          20  55455

In [15]:
users.shape

(6040, 5)

In [16]:
ratings[:5]

   user_id  movie_id  rating  timestamp
0        1      1193       5  978300760
1        1       661       3  978302109
2        1       914       3  978301968
3        1      3408       4  978300275
4        1      2355       5  978824291

In [17]:
ratings.shape

(1000209, 4)

In [18]:
movies[:5]

   movie_id                              titles                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy

In [19]:
movies.shape

(3883, 3)

In [23]:
data = pd.merge(pd.merge(ratings, users), movies)
data[:5]

,user_id,movie_id,rating,timestamp,gender,age,occupation,zip,titles,genres
0,1,1193,5,978300760,F,1,10,48067,One Flew Over the Cuckoo's Nest (1975),Drama
1,2,1193,5,978298413,M,56,16,70072,One Flew Over the Cuckoo's Nest (1975),Drama
2,12,1193,4,978220179,M,25,12,32793,One Flew Over the Cuckoo's Nest (1975),Drama
3,15,1193,4,978199279,M,25,7,22903,One Flew Over the Cuckoo's Nest (1975),Drama
4,17,1193,5,978158471,M,50,1,95350,One Flew Over the Cuckoo's Nest (1975),Drama

In [24]:
data.shape

(1000209, 10)

In [25]:
#Select the last ten observations
data[-10:]

,user_id,movie_id,rating,timestamp,gender,age,occupation,zip,titles,genres
1000199,5334,3382,5,960796159,F,56,13,46140,Song of Freedom (1936),Drama
1000200,5420,1843,3,960156505,F,1,19,14850,Slappy and the Stinkers (1998),Children's|Comedy
1000201,5433,286,3,960240881,F,35,17,45014,Nemesis 2: Nebula (1995),Action|Sci-Fi|Thriller
1000202,5494,3530,4,959816296,F,35,17,94306,Smoking/No Smoking (1993),Comedy
1000203,5556,2198,3,959445515,M,45,6,92103,Modulations (1998),Documentary
1000204,5949,2198,5,958846401,M,18,17,47901,Modulations (1998),Documentary
1000205,5675,2703,3,976029116,M,35,14,30030,Broken Vessels (1998),Drama
1000206,5780,2845,1,958153068,M,18,17,92886,White Boys (1999),Drama
1000207,5851,3607,5,957756608,F,18,20,55410,One Little Indian (1973),Comedy|Drama|Western
1000208,5938,2909,4,957273353,M,25,1,35401,"Five Wives, Three Secretaries and Me (1998)",Documentary

In [26]:
data.iloc[0]

user_id                                            1
movie_id                                        1193
rating                                             5
timestamp                                  978300760
gender                                             F
age                                                1
occupation                                        10
zip                                            48067
titles        One Flew Over the Cuckoo's Nest (1975)
genres                                         Drama
Name: 0, dtype: object

In [34]:
grp_gender= data.groupby('gender').size()
grp_gender

gender
F    246440
M    753769
dtype: int64

In [35]:
grp_gender= data.groupby(['gender', 'rating']).size()
grp_gender

gender  rating
F       1          13347
        2          24548
        3          62966
        4          87033
        5          58546
M       1          42827
        2          83009
        3         198231
        4         261938
        5         167764
dtype: int64

In [36]:
grp_gender.unstack()

rating      1      2       3       4       5
gender
F       13347  24548   62966   87033   58546
M       42827  83009  198231  261938  167764

In [38]:
mean_ratings= data.pivot_table('rating', index='titles', columns='gender', aggfunc='mean')
mean_ratings[:5]

gender                                F         M
titles
$1,000,000 Duck (1971)         3.375000  2.761905
'Night Mother (1986)           3.388889  3.352941
'Til There Was You (1997)      2.675676  2.733333
'burbs, The (1989)             2.793478  2.962085
...And Justice for All (1979)  3.828571  3.689024

In [43]:
count_titles = data.groupby('titles').size()
count_titles[:5]

titles
$1,000,000 Duck (1971)            37
'Night Mother (1986)              70
'Til There Was You (1997)         52
'burbs, The (1989)               303
...And Justice for All (1979)    199
dtype: int64

In [48]:
active_titles= count_titles.index[count_titles >= 250]
active_titles

Index([''burbs, The (1989)', '10 Things I Hate About You (1999)',
       '101 Dalmatians (1961)', '101 Dalmatians (1996)', '12 Angry Men (1957)',
       '13th Warrior, The (1999)', '2 Days in the Valley (1996)',
       '20,000 Leagues Under the Sea (1954)', '2001: A Space Odyssey (1968)',
       '2010 (1984)',
       ...
       'X-Men (2000)', 'Year of Living Dangerously (1982)',
       'Yellow Submarine (1968)', 'You've Got Mail (1998)',
       'Young Frankenstein (1974)', 'Young Guns (1988)',
       'Young Guns II (1990)', 'Young Sherlock Holmes (1985)',
       'Zero Effect (1998)', 'eXistenZ (1999)'],
      dtype='object', name='titles', length=1216)

In [47]:
#count_titles.nlargest(20)
#count_titles.argsort()

In [49]:
count_titles.argsort()

titles
$1,000,000 Duck (1971)                         185
'Night Mother (1986)                          2365
'Til There Was You (1997)                     2951
'burbs, The (1989)                            2121
...And Justice for All (1979)                  179
                                              ...
Zed & Two Noughts, A (1985)                   1789
Zero Effect (1998)                            3155
Zero Kelvin (Kjærlighetens kjøtere) (1995)    3154
Zeus and Roxanne (1997)                       3153
eXistenZ (1999)                                127
Length: 3706, dtype: int64